ChaoA51933/mcp2518fd-based-on-atsamd21g17d/mcp2518fd/firmware/src/driver/mcp25xxfd_driver/drv_canfdspi_api.c
    return (!spiTransferSuccess);
}


// *****************************************************************************
// *****************************************************************************
// Section: SPI Access Functions

int8_t DRV_CANFDSPI_ReadByte(uint16_t address, uint8_t *rxd)
{
    uint16_t spiTransmitSize = 2;
    uint16_t spiReceiveSize = 1;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_READ << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);
    spiTransmitBuffer[2] = 0;

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    spiTransferSuccess &= SERCOM1_SPI_WriteRead(NULL, 0, spiReceiveBuffer, spiReceiveSize);
    CAN_CS_Set();
    
    // Update data
    *rxd = spiReceiveBuffer[0];

    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteByte(uint16_t address, uint8_t txd)
{
    uint16_t spiTransmitSize = 3;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_WRITE << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);
    spiTransmitBuffer[2] = txd;

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_ReadWord(uint16_t address, uint32_t *rxd)
{
    uint8_t i;
    uint32_t x;
    uint16_t spiTransmitSize = 2;
    uint16_t spiReceiveSize = 4;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_READ << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    spiTransferSuccess &= SERCOM1_SPI_WriteRead(NULL, 0, spiReceiveBuffer, spiReceiveSize);
    CAN_CS_Set();
        
    if (!spiTransferSuccess) {
        return (!spiTransferSuccess);
    }

    // Update data
    *rxd = 0;
    for (i = 0; i < 4; i++) {
        x = (uint32_t) spiReceiveBuffer[i];
        *rxd += x << (i * 8);
    }

    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteWord(uint16_t address, uint32_t txd)
{
    uint8_t i;
    uint16_t spiTransmitSize = 6;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_WRITE << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);

    // Split word into 4 bytes and add them to buffer
    for (i = 0; i < 4; i++) {
        spiTransmitBuffer[i + 2] = (uint8_t) ((txd >> (i * 8)) & 0xFF);
    }

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_ReadHalfWord(uint16_t address, uint16_t *rxd)
{
    uint8_t i;
    uint32_t x;
    uint16_t spiTransmitSize = 2;
    uint16_t spiReceiveSize = 2;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_READ << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    spiTransferSuccess &= SERCOM1_SPI_WriteRead(NULL, 0, spiReceiveBuffer, spiReceiveSize);
    CAN_CS_Set();
        
    if (!spiTransferSuccess) {
        return (!spiTransferSuccess);
    }

    // Update data
    *rxd = 0;
    for (i = 0; i < 2; i++) {
        x = (uint32_t) spiReceiveBuffer[i];
        *rxd += x << (i * 8);
    }

    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteHalfWord(uint16_t address, uint16_t txd)
{
    uint8_t i;
    uint16_t spiTransmitSize = 4;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_WRITE << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);

    // Split word into 2 bytes and add them to buffer
    for (i = 0; i < 2; i++) {
        spiTransmitBuffer[i + 2] = (uint8_t) ((txd >> (i * 8)) & 0xFF);
    }

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteByteSafe(uint16_t address, uint8_t txd)
{
    uint16_t crcResult = 0;
    uint16_t spiTransmitSize = 5;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_WRITE_SAFE << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);
    spiTransmitBuffer[2] = txd;

    // Add CRC
    crcResult = DRV_CANFDSPI_CalculateCRC16(spiTransmitBuffer, 3);
    spiTransmitBuffer[3] = (crcResult >> 8) & 0xFF;
    spiTransmitBuffer[4] = crcResult & 0xFF;

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteWordSafe(uint16_t address, uint32_t txd)
{
    uint8_t i;
    uint16_t crcResult = 0;
    uint16_t spiTransmitSize = 8;
    int8_t spiTransferSuccess = 0;

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_WRITE_SAFE << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);

    // Split word into 4 bytes and add them to buffer
    for (i = 0; i < 4; i++) {
        spiTransmitBuffer[i + 2] = (uint8_t) ((txd >> (i * 8)) & 0xFF);
    }

    // Add CRC
    crcResult = DRV_CANFDSPI_CalculateCRC16(spiTransmitBuffer, 6);
    spiTransmitBuffer[6] = (crcResult >> 8) & 0xFF;
    spiTransmitBuffer[7] = crcResult & 0xFF;

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
