ChaoA51933/mcp2518fd-based-on-atsamd21g17d/mcp2518fd/firmware/src/driver/mcp25xxfd_driver/drv_canfdspi_api.c
    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_ReadByteArray(uint16_t address, uint8_t *rxd, uint16_t nBytes)
{
    uint16_t i;
    uint16_t spiTransmitSize = 2;
    uint16_t spiReceiveSize = nBytes;
    int8_t spiTransferSuccess = 0;    

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_READ << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    spiTransferSuccess &= SERCOM1_SPI_WriteRead(NULL, 0, spiReceiveBuffer, spiReceiveSize);
    CAN_CS_Set();
        
    if (!spiTransferSuccess) {
        return (!spiTransferSuccess);
    }
    
    // Update data
    for (i = 0; i < nBytes; i++) {
        rxd[i] = spiReceiveBuffer[i];
    }

    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_ReadByteArrayWithCRC(uint16_t address,
        uint8_t *rxd, uint16_t nBytes, bool fromRam, bool* crcIsCorrect)
{
    uint8_t i;
    uint16_t crcFromSpiSlave = 0;
    uint16_t crcAtController = 0;   
    uint16_t spiTransmitSize = 5;   //first two bytes for sending command & address, third for size, last two bytes for CRC
    uint16_t spiReceiveSize = nBytes;
    int8_t spiTransferSuccess = 0;      

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_READ_CRC << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);
    if (fromRam) {
        spiTransmitBuffer[2] = nBytes >> 2;
    } else {
        spiTransmitBuffer[2] = nBytes;
    }

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    spiTransferSuccess &= SERCOM1_SPI_WriteRead(NULL, 0, (spiReceiveBuffer + 3), spiReceiveSize);    
    CAN_CS_Set();
        
    if (!spiTransferSuccess) {
        return (!spiTransferSuccess);
    }

    // Get CRC from controller
    crcFromSpiSlave = (uint16_t) (spiReceiveBuffer[spiReceiveSize - 2] << 8) + (uint16_t) (spiReceiveBuffer[spiReceiveSize - 1]);

    // Use the receive buffer to calculate CRC
    // First three bytes need to be command
    spiReceiveBuffer[0] = spiTransmitBuffer[0];
    spiReceiveBuffer[1] = spiTransmitBuffer[1];
    spiReceiveBuffer[2] = spiTransmitBuffer[2];
    crcAtController = DRV_CANFDSPI_CalculateCRC16(spiReceiveBuffer, nBytes + 3);

    // Compare CRC readings
    if (crcFromSpiSlave == crcAtController) {
        *crcIsCorrect = true;
    } else {
        *crcIsCorrect = false;
    }

    // Update data
    for (i = 0; i < nBytes; i++) {
        rxd[i] = spiReceiveBuffer[i + 3];
    }

    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteByteArray(uint16_t address,
        uint8_t *txd, uint16_t nBytes)
{
    uint16_t i;
    uint16_t spiTransmitSize = nBytes + 2;
    int8_t spiTransferSuccess = 0;    

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_WRITE << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);

    // Add data
    for (i = 2; i < spiTransmitSize; i++) {
        spiTransmitBuffer[i] = txd[i - 2];
    }

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteByteArrayWithCRC(uint16_t address,
        uint8_t *txd, uint16_t nBytes, bool fromRam)
{
    uint16_t i;
    uint16_t crcResult = 0;
    uint16_t spiTransmitSize = nBytes + 5;
    int8_t spiTransferSuccess = 0;    

    // Compose command
    spiTransmitBuffer[0] = (uint8_t) ((cINSTRUCTION_WRITE_CRC << 4) + ((address >> 8) & 0xF));
    spiTransmitBuffer[1] = (uint8_t) (address & 0xFF);
    if (fromRam) {
        spiTransmitBuffer[2] = nBytes >> 2;
    } else {
        spiTransmitBuffer[2] = nBytes;
    }

    // Add data
    for (i = 0; i < nBytes; i++) {
        spiTransmitBuffer[i + 3] = txd[i];
    }

    // Add CRC
    crcResult = DRV_CANFDSPI_CalculateCRC16(spiTransmitBuffer, spiTransmitSize - 2);
    spiTransmitBuffer[spiTransmitSize - 2] = (uint8_t) ((crcResult >> 8) & 0xFF);
    spiTransmitBuffer[spiTransmitSize - 1] = (uint8_t) (crcResult & 0xFF);

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_ReadWordArray(uint16_t address,
        uint32_t *rxd, uint16_t nWords)
{
    uint16_t i, j, n;
    REG_t w;

    uint16_t spiTransmitSize = 2;
    uint16_t spiReceiveSize = nWords * 4;
    int8_t spiTransferSuccess = 0;     

    // Compose command
    spiTransmitBuffer[0] = (cINSTRUCTION_READ << 4) + ((address >> 8) & 0xF);
    spiTransmitBuffer[1] = address & 0xFF;

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    spiTransferSuccess &= SERCOM1_SPI_WriteRead(NULL, 0, spiReceiveBuffer, spiReceiveSize);
    CAN_CS_Set();
        
    if (!spiTransferSuccess) {
        return (!spiTransferSuccess);
    }

    // Convert Byte array to Word array
    n = 0;
    for (i = 0; i < nWords; i++) {
        w.word = 0;
        for (j = 0; j < 4; j++, n++) {
            w.byte[j] = spiReceiveBuffer[n];
        }
        rxd[i] = w.word;
    }

    return (!spiTransferSuccess);
}

int8_t DRV_CANFDSPI_WriteWordArray(uint16_t address,
        uint32_t *txd, uint16_t nWords)
{
    uint16_t i, j, n;
    REG_t w;
    uint16_t spiTransmitSize = nWords * 4 + 2;
    int8_t spiTransferSuccess = 0;      

    // Compose command
    spiTransmitBuffer[0] = (cINSTRUCTION_WRITE << 4) + ((address >> 8) & 0xF);
    spiTransmitBuffer[1] = address & 0xFF;

    // Convert ByteArray to word array
    n = 2;
    for (i = 0; i < nWords; i++) {
        w.word = txd[i];
        for (j = 0; j < 4; j++, n++) {
            spiTransmitBuffer[n] = w.byte[j];
        }
    }

    CAN_CS_Clear();
    spiTransferSuccess = SERCOM1_SPI_WriteRead(spiTransmitBuffer, spiTransmitSize, NULL, 0);
    CAN_CS_Set();
    
